zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v3.c
void Cy_SysPm_SetHibernateWakeupSource(uint32_t wakeupSource)
{
    CY_ASSERT_L3(CY_SYSPM_IS_WAKE_UP_SOURCE_VALID(wakeupSource));

#if defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION == 3u) && defined (CY_IP_MXS40SRSS_VERSION_MINOR) && (CY_IP_MXS40SRSS_VERSION_MINOR >= 3u)
    uint32_t polarityMask = 0U;
    uint32_t wakeSrcMask = 0U;

    /* PIN0 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN0_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN0_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 0)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN0_LOW;
        }
    }

    /* PIN1 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN1_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN1_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 1)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN1_LOW;
        }
    }

    /* PIN2 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN2_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN2_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 2)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN2_LOW;
        }
    }

    /* PIN3 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN3_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN3_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 3)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN3_LOW;
        }
    }

    /* PIN4 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN4_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN4_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 4)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN4_LOW;
        }
    }

    /* PIN5 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN5_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN5_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 5)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN5_LOW;
        }
    }

    /* PIN6 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN6_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN6_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 6)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN6_LOW;
        }
    }

    /* PIN7 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN7_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN7_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 7)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN7_LOW;
        }
    }

    /* PIN8 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN8_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN8_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 8)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN8_LOW;
        }
    }

    /* PIN9 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN9_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN9_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 9)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN9_LOW;
        }
    }

    /* CSV_BAK */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_CSV_BAK))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_CSV_BAK;
    }

    /* RTC */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_RTC_ALARM))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_RTC_ALARM;
    }

    /* WDT */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_WDT))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_WDT;
    }

    SRSS_PWR_HIB_WAKE_CTL = (SRSS_PWR_HIB_WAKE_CTL | wakeSrcMask);
    SRSS_PWR_HIB_WAKE_CTL2 = (SRSS_PWR_HIB_WAKE_CTL2 | polarityMask);

    /* Read registers to make sure it is settled */
    (void) SRSS_PWR_HIB_WAKE_CTL;
    (void) SRSS_PWR_HIB_WAKE_CTL2;
#else
    uint32_t polarityMask = 0U;

    if (0U != _FLD2VAL(SRSS_PWR_HIBERNATE_POLARITY_HIBPIN, wakeupSource))
    {
        /* Reconfigure the wakeup pins and LPComp polarity based on the input */
        if (0U != (wakeupSource & CY_SYSPM_HIB_WAKEUP_LPCOMP0_MASK))
        {
            polarityMask |= CY_SYSPM_HIB_WAKEUP_LPCOMP0_POLARITY_HIGH_MASK;
        }

        if (0U != (wakeupSource & CY_SYSPM_HIB_WAKEUP_LPCOMP1_MASK))
        {
            polarityMask |= CY_SYSPM_HIB_WAKEUP_LPCOMP1_POLARITY_HIGH_MASK;
        }

        if (0U != (wakeupSource & CY_SYSPM_HIB_WAKEUP_PIN0_MASK))
        {
            polarityMask |= CY_SYSPM_HIB_WAKEUP_PIN0_POLARITY_HIGH_MASK;
        }

        if (0U != (wakeupSource & CY_SYSPM_HIB_WAKEUP_PIN1_MASK))
        {
            polarityMask |= CY_SYSPM_HIB_WAKEUP_PIN1_POLARITY_HIGH_MASK;
        }
    }

    SRSS_PWR_HIBERNATE = (SRSS_PWR_HIBERNATE & (uint32_t) ~polarityMask) | wakeupSource;

    /* Read register to make sure it is settled */
    (void) SRSS_PWR_HIBERNATE;
#endif

}

void Cy_SysPm_ClearHibernateWakeupSource(uint32_t wakeupSource)
{
    CY_ASSERT_L3(CY_SYSPM_IS_WAKE_UP_SOURCE_VALID(wakeupSource));

#if defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION == 3u) && defined (CY_IP_MXS40SRSS_VERSION_MINOR) && (CY_IP_MXS40SRSS_VERSION_MINOR >= 3u)

    uint32_t polarityMask = 0U;
    uint32_t wakeSrcMask = 0U;

    /* PIN0 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN0_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN0_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 0)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN0_LOW;
        }
    }

    /* PIN1 */
    if (0U != (wakeupSource & (uint32_t)CY_SYSPM_HIBERNATE_PIN1_LOW))
    {
        wakeSrcMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN1_LOW;
        if (0U != (wakeupSource & (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 1)))
        {
            polarityMask |= (uint32_t)CY_SYSPM_HIBERNATE_PIN1_LOW;
        }
    }

