zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v3.c
    while(wordSize != 0UL)
    {
        *wordDstPointer = BACKUP_BREG[wordIndex];

        wordIndex++;
        wordDstPointer++;
        wordSize--;
    }
}
#endif  /* defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (defined (SRSS_BACKUP_PRESENT) && (SRSS_BACKUP_PRESENT == 1u))) */

cy_en_syspm_status_t Cy_SysPm_SetSRAMMacroPwrMode(cy_en_syspm_sram_index_t sramNum, uint32_t sramMacroNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    cy_en_syspm_status_t status = CY_SYSPM_BAD_PARAM;

    CY_ASSERT_L1( sramNum < CPUSS_SRAM_COUNT );

    if(sramNum == CY_SYSPM_SRAM0_MEMORY)
    {
        CY_ASSERT_L1( sramMacroNum < CPUSS_RAMC0_MACRO_NR );
        if (sramMacroNum < CPUSS_RAMC0_MACRO_NR)
        {
            CPUSS_RAM0_PWR_MACRO_CTL(sramMacroNum) = _VAL2FLD(CPUSS_RAM0_PWR_MACRO_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                                _VAL2FLD(CPUSS_RAM0_PWR_MACRO_CTL_PWR_MODE, sramPwrMode);
            status = CY_SYSPM_SUCCESS;
        }
    }
    else if(sramNum == CY_SYSPM_SRAM1_MEMORY)
    {
        CY_ASSERT_L1( CPUSS_RAMC1_PRESENT );
        CY_ASSERT_L1( sramMacroNum == 0UL );

        CPUSS_RAM1_PWR_CTL = _VAL2FLD(CPUSS_RAM1_PWR_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                    _VAL2FLD(CPUSS_RAM1_PWR_CTL_PWR_MODE, sramPwrMode);
        status = CY_SYSPM_SUCCESS;
    }
    else if(sramNum == CY_SYSPM_SRAM2_MEMORY)
    {
        CY_ASSERT_L1( CPUSS_RAMC2_PRESENT );
        CY_ASSERT_L1( sramMacroNum == 0UL );

        CPUSS_RAM2_PWR_CTL = _VAL2FLD(CPUSS_RAM2_PWR_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                    _VAL2FLD(CPUSS_RAM2_PWR_CTL_PWR_MODE, sramPwrMode);
        status = CY_SYSPM_SUCCESS;
    }
    else
    {
        /* Invalid SRAM Number */
    }

    return status;
}


cy_en_syspm_sram_pwr_mode_t Cy_SysPm_GetSRAMMacroPwrMode(cy_en_syspm_sram_index_t sramNum, uint32_t sramMacroNum)
{
    uint32_t retVal = (uint32_t)CY_SYSPM_SRAM_PWR_MODE_INVALID;

    CY_ASSERT_L1( sramNum < CPUSS_SRAM_COUNT );

    if(sramNum == CY_SYSPM_SRAM0_MEMORY)
    {
        CY_ASSERT_L1( sramMacroNum < CPUSS_RAMC0_MACRO_NR );
        if (sramMacroNum < CPUSS_RAMC0_MACRO_NR)
        {
            retVal = _FLD2VAL(CPUSS_RAM0_PWR_MACRO_CTL_PWR_MODE, CPUSS_RAM0_PWR_MACRO_CTL(sramMacroNum));
        }
    }
    else if(sramNum == CY_SYSPM_SRAM1_MEMORY)
    {
        CY_ASSERT_L1( sramMacroNum == 0UL );
        retVal = _FLD2VAL(CPUSS_RAM1_PWR_CTL_PWR_MODE, CPUSS_RAM1_PWR_CTL);
    }
    else if(sramNum == CY_SYSPM_SRAM2_MEMORY)
    {
        CY_ASSERT_L1( sramMacroNum == 0UL );
        retVal = _FLD2VAL(CPUSS_RAM2_PWR_CTL_PWR_MODE, CPUSS_RAM2_PWR_CTL);
    }
    else
    {
        /* Invalid SRAM Number */
    }
    return (cy_en_syspm_sram_pwr_mode_t)retVal;
}


cy_en_syspm_status_t Cy_SysPm_SetSRAMPwrMode(cy_en_syspm_sram_index_t sramNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    uint32 idx;

    cy_en_syspm_status_t status = CY_SYSPM_BAD_PARAM;
    CY_ASSERT_L1( sramNum < CPUSS_SRAM_COUNT );

    if(sramNum == CY_SYSPM_SRAM0_MEMORY)
    {
        for(idx = 0UL; idx < CPUSS_RAMC0_MACRO_NR; idx++)
        {
            CPUSS_RAM0_PWR_MACRO_CTL(idx) = _VAL2FLD(CPUSS_RAM0_PWR_MACRO_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                        _VAL2FLD(CPUSS_RAM0_PWR_MACRO_CTL_PWR_MODE, sramPwrMode);
        }
        status = CY_SYSPM_SUCCESS;
    }
    else if(sramNum == CY_SYSPM_SRAM1_MEMORY)
    {
        CY_ASSERT_L1( CPUSS_RAMC1_PRESENT );
        CPUSS_RAM1_PWR_CTL = _VAL2FLD(CPUSS_RAM1_PWR_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                        _VAL2FLD(CPUSS_RAM1_PWR_CTL_PWR_MODE, sramPwrMode);
        status = CY_SYSPM_SUCCESS;

    }
    else if(sramNum == CY_SYSPM_SRAM2_MEMORY)
    {
        CY_ASSERT_L1( CPUSS_RAMC2_PRESENT );
        CPUSS_RAM2_PWR_CTL = _VAL2FLD(CPUSS_RAM2_PWR_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                        _VAL2FLD(CPUSS_RAM2_PWR_CTL_PWR_MODE, sramPwrMode);
        status = CY_SYSPM_SUCCESS;

    }
    else
    {
        /* Invalid SRAM Number */
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_SysPm_ReadStatus
****************************************************************************//**
*
* Reads the status of the core(s).
*
* \return The current power mode. See \ref group_syspm_return_status.
*
*******************************************************************************/
uint32_t Cy_SysPm_ReadStatus(void)
{
    uint32_t interruptState;
    uint32_t pmStatus = 0u;
    interruptState = Cy_SysLib_EnterCriticalSection();

    #if defined(CY_IP_M7CPUSS) && (CY_IP_M7CPUSS == 1u)
    /* Check whether CM7_0 is in the deep sleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM7_0_STATUS_SLEEPING, CPUSS_CM7_0_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM7_0_STATUS_SLEEPDEEP, CPUSS_CM7_0_STATUS)))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_0_DEEPSLEEP;
    }
    /* Check whether CM7_0 is in the sleep mode*/
    else if(0u != _FLD2VAL(CPUSS_CM7_0_STATUS_SLEEPING, CPUSS_CM7_0_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_0_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_0_ACTIVE;
    }

    /* Check whether CM7_1 is in the deep sleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM7_1_STATUS_SLEEPING, CPUSS_CM7_1_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM7_1_STATUS_SLEEPDEEP, CPUSS_CM7_1_STATUS)))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_1_DEEPSLEEP;
    }
    /* Check whether CM7_1 is in the sleep mode*/
    else if(0u != _FLD2VAL(CPUSS_CM7_1_STATUS_SLEEPING, CPUSS_CM7_1_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_1_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_1_ACTIVE;
    }

    #if (CY_IP_M7CPUSS_VERSION == 2)
    /* Check whether CM7_2 is in the deep sleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM7_2_STATUS_SLEEPING, CPUSS_CM7_2_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM7_2_STATUS_SLEEPDEEP, CPUSS_CM7_2_STATUS)))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_2_DEEPSLEEP;
    }
    /* Check whether CM7_2 is in the sleep mode*/
    else if(0u != _FLD2VAL(CPUSS_CM7_2_STATUS_SLEEPING, CPUSS_CM7_2_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_2_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_2_ACTIVE;
    }

    /* Check whether CM7_3 is in the deep sleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM7_3_STATUS_SLEEPING, CPUSS_CM7_3_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM7_3_STATUS_SLEEPDEEP, CPUSS_CM7_3_STATUS)))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_3_DEEPSLEEP;
    }
    /* Check whether CM7_3 is in the sleep mode*/
    else if(0u != _FLD2VAL(CPUSS_CM7_3_STATUS_SLEEPING, CPUSS_CM7_3_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_3_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_3_ACTIVE;
    }
    #endif /* CY_IP_M7CPUSS_VERSION == 2 */
    #elif defined(CY_IP_M4CPUSS) && (CY_IP_M4CPUSS == 1u)
    /* Check whether CM4 is in Deep Sleep mode */
    if ((CPUSS_CM4_STATUS & CM4_DEEPSLEEP_MASK) == CM4_DEEPSLEEP_MASK)
    {
        pmStatus |= CY_SYSPM_STATUS_CM4_DEEPSLEEP;
    }
    /* Check whether CM4 is in Sleep mode */
    else if(0U != _FLD2VAL(CPUSS_CM4_STATUS_SLEEPING, CPUSS_CM4_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM4_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM4_ACTIVE;
    }
    #else
    /**/
    #endif


    /* Check whether CM0p is in the sleep or deep sleep mode*/
    if (0u != _FLD2VAL(CPUSS_CM0_STATUS_SLEEPING, CPUSS_CM0_STATUS))
    {
        if (0u != _FLD2VAL(CPUSS_CM0_STATUS_SLEEPDEEP, CPUSS_CM0_STATUS))
        {
            pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM0_DEEPSLEEP;
        }
        else
        {
            pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM0_SLEEP;
        }
    }
    else
    {
        pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM0_ACTIVE;
    }

