zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v3.c
    /* Check whether the device is in LPACTIVE mode or not */
    if(Cy_SysPm_IsSystemLpActiveEnabled())
    {
        pmStatus |= (uint32_t) CY_SYSPM_STATUS_SYSTEM_LOWPOWER;
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    return(pmStatus);
}

#if defined(CY_IP_M7CPUSS) && (CY_IP_M7CPUSS == 1u)
bool Cy_SysPm_Cm7IsActive(uint8_t core)
{
    bool status = false;

    if(core == CORE_CM7_0)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_0_ACTIVE) != 0u);
    }
    else if(core == CORE_CM7_1)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_1_ACTIVE) != 0u);
    }
#if (CY_IP_M7CPUSS_VERSION == 2)
    else if(core == CORE_CM7_2)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_2_ACTIVE) != 0u);
    }
    else if(core == CORE_CM7_3)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_3_ACTIVE) != 0u);
    }
#endif /* CY_IP_M7CPUSS_VERSION == 2 */
    else
    {
        /* CM7 Not active */
    }

    return status;
}

bool Cy_SysPm_Cm7IsSleep(uint8_t core)
{
    bool status = false;

    if(core == CORE_CM7_0)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_0_SLEEP) != 0u);
    }
    else if(core == CORE_CM7_1)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_1_SLEEP) != 0u);
    }
#if (CY_IP_M7CPUSS_VERSION == 2)
    else if(core == CORE_CM7_2)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_2_SLEEP) != 0u);
    }
    else if(core == CORE_CM7_3)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_3_SLEEP) != 0u);
    }
#endif /* CY_IP_M7CPUSS_VERSION == 2 */
    else
    {
        /* CM7 Not active */
    }

    return status;
}

bool Cy_SysPm_Cm7IsDeepSleep(uint8_t core)
{
    bool status = false;

    if(core == CORE_CM7_0)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_0_DEEPSLEEP) != 0u);
    }
    else if(core == CORE_CM7_1)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_1_DEEPSLEEP) != 0u);
    }
#if (CY_IP_M7CPUSS_VERSION == 2)
    else if(core == CORE_CM7_2)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_2_DEEPSLEEP) != 0u);
    }
    else if(core == CORE_CM7_3)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_3_DEEPSLEEP) != 0u);
    }
#endif /* CY_IP_M7CPUSS_VERSION == 2 */
    else
    {
        /* CM7 Not active */
    }

    return status;
}


#endif // defined(CY_IP_M7CPUSS) && (CY_IP_M7CPUSS == 1u)

#if defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS == 1u)
bool Cy_SysPm_Cm4IsActive(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM4_ACTIVE) != 0U);
}


bool Cy_SysPm_Cm4IsSleep(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM4_SLEEP) != 0U);
}


bool Cy_SysPm_Cm4IsDeepSleep(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM4_DEEPSLEEP) != 0U);
}

#endif // defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS == 1u)

bool Cy_SysPm_Cm0IsActive(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM0_ACTIVE) != 0u);
}

bool Cy_SysPm_Cm0IsSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM0_SLEEP) != 0u);
}

bool Cy_SysPm_Cm0IsDeepSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM0_DEEPSLEEP) != 0u);
}

bool Cy_SysPm_IsSystemLp(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_SYSTEM_LOWPOWER) != 0u);
}

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2u)) || \
    ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2u)) && (defined (SRSS_BACKUP_VBCK_PRESENT) && (SRSS_BACKUP_VBCK_PRESENT == 1u)))
void Cy_SysPm_PmicEnable(void)
{
    if(CY_SYSPM_PMIC_UNLOCK_KEY == _FLD2VAL(BACKUP_PMIC_CTL_UNLOCK, BACKUP_PMIC_CTL))
    {
        BACKUP_PMIC_CTL =
        _VAL2FLD(BACKUP_PMIC_CTL_UNLOCK, CY_SYSPM_PMIC_UNLOCK_KEY) |
        _VAL2FLD(BACKUP_PMIC_CTL_PMIC_EN_OUTEN, 1u) |
        _VAL2FLD(BACKUP_PMIC_CTL_PMIC_EN, 1u);
    }
}


void Cy_SysPm_PmicDisable(cy_en_syspm_pmic_wakeup_polarity_t polarity)
{
    if(CY_SYSPM_PMIC_UNLOCK_KEY == _FLD2VAL(BACKUP_PMIC_CTL_UNLOCK, BACKUP_PMIC_CTL))
    {
        BACKUP_PMIC_CTL =
        (_VAL2FLD(BACKUP_PMIC_CTL_UNLOCK, CY_SYSPM_PMIC_UNLOCK_KEY) |
         _CLR_SET_FLD32U(BACKUP_PMIC_CTL, BACKUP_PMIC_CTL_POLARITY, polarity)) &
        ((uint32_t) ~ _VAL2FLD(BACKUP_PMIC_CTL_PMIC_EN, 1u));
    }
}


void Cy_SysPm_PmicAlwaysEnable(void)
{
    BACKUP_PMIC_CTL |= _VAL2FLD(BACKUP_PMIC_CTL_PMIC_ALWAYSEN, 1u);
}


void Cy_SysPm_PmicEnableOutput(void)
{
    if(CY_SYSPM_PMIC_UNLOCK_KEY == _FLD2VAL(BACKUP_PMIC_CTL_UNLOCK, BACKUP_PMIC_CTL))
    {
        BACKUP_PMIC_CTL |=
        _VAL2FLD(BACKUP_PMIC_CTL_UNLOCK, CY_SYSPM_PMIC_UNLOCK_KEY) | _VAL2FLD(BACKUP_PMIC_CTL_PMIC_EN_OUTEN, 1u);
    }
}


void Cy_SysPm_PmicDisableOutput(void)
{
    if(CY_SYSPM_PMIC_UNLOCK_KEY == _FLD2VAL(BACKUP_PMIC_CTL_UNLOCK, BACKUP_PMIC_CTL))
    {
        BACKUP_PMIC_CTL =
        (BACKUP_PMIC_CTL | _VAL2FLD(BACKUP_PMIC_CTL_UNLOCK, CY_SYSPM_PMIC_UNLOCK_KEY)) &
        ((uint32_t) ~ _VAL2FLD(BACKUP_PMIC_CTL_PMIC_EN_OUTEN, 1u));
    }
}


void Cy_SysPm_PmicLock(void)
{
    BACKUP_PMIC_CTL = _CLR_SET_FLD32U(BACKUP_PMIC_CTL, BACKUP_PMIC_CTL_UNLOCK, 0u);
}


void Cy_SysPm_PmicUnlock(void)
{
    BACKUP_PMIC_CTL = _CLR_SET_FLD32U(BACKUP_PMIC_CTL, BACKUP_PMIC_CTL_UNLOCK, CY_SYSPM_PMIC_UNLOCK_KEY);
}


bool Cy_SysPm_PmicIsEnabled(void)
{
    return(0u != _FLD2VAL(BACKUP_PMIC_CTL_PMIC_EN, BACKUP_PMIC_CTL));
}


bool Cy_SysPm_PmicIsOutputEnabled(void)
{
    return (0U != _FLD2VAL(BACKUP_PMIC_CTL_PMIC_EN_OUTEN, BACKUP_PMIC_CTL));
}


bool Cy_SysPm_PmicIsLocked(void)
{
    return((_FLD2VAL(BACKUP_PMIC_CTL_UNLOCK, BACKUP_PMIC_CTL) == CY_SYSPM_PMIC_UNLOCK_KEY) ? false : true);
}
#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2u)) || \
    ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2u)) && (defined (SRSS_BACKUP_VBCK_PRESENT) && (SRSS_BACKUP_VBCK_PRESENT == 1u))) */

void Cy_SysPm_OvdEnable(cy_en_syspm_ovd_sel_t ovdSel)
{
    switch(ovdSel)
    {
    case CY_SYSPM_OVD_ON_VDDD:
      SRSS_PWR_SSV_CTL |= SRSS_PWR_SSV_CTL_OVDVDDD_ENABLE_Msk;
      break;

    case CY_SYSPM_OVD_ON_VDDA:
      SRSS_PWR_SSV_CTL |= SRSS_PWR_SSV_CTL_OVDVDDA_ENABLE_Msk;
      break;

    case CY_SYSPM_OVD_ON_VCCD:
      SRSS_PWR_SSV_CTL |= SRSS_PWR_SSV_CTL_OVDVCCD_ENABLE_Msk;
      break;

    default:
      (void)SRSS_PWR_SSV_STATUS; /* To Fix Coverity */
      break;
    }
}


void Cy_SysPm_OvdDisable(cy_en_syspm_ovd_sel_t ovdSel)
{
    switch(ovdSel)
    {
    case CY_SYSPM_OVD_ON_VDDD:
      SRSS_PWR_SSV_CTL &= (uint32_t) ~SRSS_PWR_SSV_CTL_OVDVDDD_ENABLE_Msk;
      break;

    case CY_SYSPM_OVD_ON_VDDA:
      SRSS_PWR_SSV_CTL &= (uint32_t) ~SRSS_PWR_SSV_CTL_OVDVDDA_ENABLE_Msk;
      break;

    case CY_SYSPM_OVD_ON_VCCD:
      SRSS_PWR_SSV_CTL &= (uint32_t) ~SRSS_PWR_SSV_CTL_OVDVCCD_ENABLE_Msk;
      break;

    default:
      (void)SRSS_PWR_SSV_STATUS; /* To Fix Coverity */
      break;
    }
}


void Cy_SysPm_OvdVdddSelect(cy_en_syspm_ovd_vddd_sel_t ovdVdddSel)
{
    SRSS_PWR_SSV_CTL = _CLR_SET_FLD32U(SRSS_PWR_SSV_CTL, SRSS_PWR_SSV_CTL_OVDVDDD_VSEL, ovdVdddSel);
}


void Cy_SysPm_OvdVddaSelect(cy_en_syspm_ovd_vdda_sel_t ovdVddaSel)
{
    SRSS_PWR_SSV_CTL = _CLR_SET_FLD32U(SRSS_PWR_SSV_CTL, SRSS_PWR_SSV_CTL_OVDVDDA_VSEL, ovdVddaSel);
}


void Cy_SysPm_OvdActionSelect(cy_en_syspm_ovd_action_select_t ovdActionSelect)
{
    CY_ASSERT(CY_OVD_CHECK_ACTION_CFG(ovdActionSelect));

    SRSS_PWR_SSV_CTL = _CLR_SET_FLD32U(SRSS_PWR_SSV_CTL, SRSS_PWR_SSV_CTL_OVDVDDA_ACTION, ovdActionSelect);
}


void Cy_SysPm_BodEnable(cy_en_syspm_bod_sel_t bodSel)
{
    switch(bodSel)
    {
    case CY_SYSPM_BOD_ON_VDDD:
      SRSS_PWR_SSV_CTL |= SRSS_PWR_SSV_CTL_BODVDDD_ENABLE_Msk;
      break;

    case CY_SYSPM_BOD_ON_VDDA:
      SRSS_PWR_SSV_CTL |= SRSS_PWR_SSV_CTL_BODVDDA_ENABLE_Msk;
      break;

    case CY_SYSPM_BOD_ON_VCCD:
      SRSS_PWR_SSV_CTL |= SRSS_PWR_SSV_CTL_BODVCCD_ENABLE_Msk;
      break;

    default:
      (void)SRSS_PWR_SSV_STATUS; /* To Fix Coverity */
      break;
    }
}


void Cy_SysPm_BodDisable(cy_en_syspm_bod_sel_t bodSel)
{
    switch(bodSel)
    {
    case CY_SYSPM_BOD_ON_VDDD:
      SRSS_PWR_SSV_CTL &= (uint32_t) ~SRSS_PWR_SSV_CTL_BODVDDD_ENABLE_Msk;
      break;

    case CY_SYSPM_BOD_ON_VDDA:
      SRSS_PWR_SSV_CTL &= (uint32_t) ~SRSS_PWR_SSV_CTL_BODVDDA_ENABLE_Msk;
      break;

    case CY_SYSPM_BOD_ON_VCCD:
      SRSS_PWR_SSV_CTL &= (uint32_t) ~SRSS_PWR_SSV_CTL_BODVCCD_ENABLE_Msk;
      break;

    default:
      (void)SRSS_PWR_SSV_STATUS; /* To Fix Coverity */
      break;
    }
}


void Cy_SysPm_BodVdddSelect(cy_en_syspm_bod_vddd_sel_t bodVdddSel)
{
    SRSS_PWR_SSV_CTL = _CLR_SET_FLD32U(SRSS_PWR_SSV_CTL, SRSS_PWR_SSV_CTL_BODVDDD_VSEL, bodVdddSel);
}


void Cy_SysPm_BodVddaSelect(cy_en_syspm_bod_vdda_sel_t bodVddaSel)
{
    SRSS_PWR_SSV_CTL = _CLR_SET_FLD32U(SRSS_PWR_SSV_CTL, SRSS_PWR_SSV_CTL_BODVDDA_VSEL, bodVddaSel);
}


