zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v3.c
void Cy_SysPm_ReghcDisablePmicInDeepSleep(void)
{
    SRSS_PWR_REGHC_CTL4 &= (uint32_t) ~SRSS_PWR_REGHC_CTL4_REGHC_PMIC_DPSLP_Msk;
}

void Cy_SysPm_ReghcEnablePmicInDeepSleep(void)
{
    SRSS_PWR_REGHC_CTL4 |= SRSS_PWR_REGHC_CTL4_REGHC_PMIC_DPSLP_Msk;
}

bool Cy_SysPm_ReghcIsOcdWithinLimits(void)
{
    return (_FLD2BOOL(SRSS_PWR_REGHC_STATUS_REGHC_OCD_OK, SRSS_PWR_REGHC_STATUS));
}

bool Cy_SysPm_ReghcIsCircuitEnabledAndOperating(void)
{
    return (_FLD2BOOL(SRSS_PWR_REGHC_STATUS_REGHC_CKT_OK, SRSS_PWR_REGHC_STATUS));
}

cy_en_syspm_status_t Cy_SysPm_ReghcConfigure(cy_en_syspm_reghc_mode_t mode, cy_en_syspm_reghc_vadj_t vadj)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_TIMEOUT;
    uint32_t timeOut = REGHC_WAIT_DELAY_TRIES_US;

    /* Current support is for External Transistor mode only */
    CY_ASSERT_L3(mode == CY_SYSPM_REGHC_MODE_TRANSISTOR);

    /* a. Write PWR_REGHC_CTL.REGHC_MODE = 0 to configure the external transistor mode. */
    Cy_SysPm_ReghcSelectMode(mode);

    /* b. Write PWR_REGHC_CTL.REGHC_TRANS_USE_OCD = 1 */
    //HW default is "1"

    /* c. Write PWR_REGHC_CTL.REGHC_VADJ to the required feedback setting.*/
    Cy_SysPm_ReghcAdjustOutputVoltage(vadj);

    /* d. Write PWR_REGHC_CTL.REGHC_CONFIGURED = 1. */
    Cy_SysPm_ReghcSetConfigured();

    /* e. Execute the system call (LoadRegulatorTrims) to change internal regulator trims. */
    //HW takes care

    /* f. Write PWR_REGHC_CTL2.REGHC_EN = 1. */
    Cy_SysPm_ReghcEnable();

    /* g. Wait until PWR_REGHC_STATUS.REGHC_SEQ_BUSY = 0 and PWR_REGHC_STATUS.REGHC_ENABLED = 1.
     * This should occur within 15us.
     */
    while (((true == Cy_SysPm_ReghcIsSequencerBusy()) || (false == Cy_SysPm_ReghcIsEnabled())) && (0U != timeOut))
    {
        Cy_SysLib_DelayUs(1U);
        timeOut--;
    }

    if (0U != timeOut)
    {
        retVal= CY_SYSPM_SUCCESS;
    }

    return retVal;
}

cy_en_syspm_status_t Cy_SysPm_ReghcDeConfigure(void)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_TIMEOUT;
    uint32_t timeOut = REGHC_WAIT_DELAY_TRIES_US;

    /* a. Write PWR_REGHC_CTL2.REGHC_EN = 0. */
    Cy_SysPm_ReghcDisable();

    /* b. Wait until PWR_REGHC_STATUS.REGHC_SEQ_BUSY = 0 and PWR_REGHC_STATUS.REGHC_ENABLED = 0.
     * This should occur within 10 us.
     */
    while (((true == Cy_SysPm_ReghcIsSequencerBusy()) || (true == Cy_SysPm_ReghcIsEnabled())) && (0U != timeOut))
    {
        Cy_SysLib_DelayUs(1U);
        timeOut--;
    }

    if (0U != timeOut)
    {
        retVal= CY_SYSPM_SUCCESS;
    }

    return retVal;
}


#endif  /* (SRSS_S40E_REGHC_PRESENT == 1u) || (SRSS_S40E_HTREGHC_PRESENT == 1u) */


#endif /* (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2) */

/* [] END OF FILE */
